benchmark/old_outputs/thread_equals_client/lfu/uni_2/2026-04-20T11:08:56-04:00_1_1_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 2
number of threads: 2
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 766564
number of failed transactions: 0 (0.000%)
latency average = 0.470 ms
initial connection time = 1.519 ms
tps = 4258.715884 (without initial connection time)
SQL script 1: pgscripts/uniform_select.sql
 - weight: 1 (targets 50.0% of total)
 - 383582 transactions (50.0% of total)
 - number of transactions actually processed: 383582 (tps = 2131.024619)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.339 ms
 - latency stddev = 0.469 ms
SQL script 2: pgscripts/uniform_update.sql
 - weight: 1 (targets 50.0% of total)
 - 382980 transactions (50.0% of total)
 - number of transactions actually processed: 382980 (tps = 2127.680154)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.600 ms
 - latency stddev = 0.648 ms
ratio: .6663407773022229